Reports/СверкаДекларацийПрибыльНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаДекларацийПрибыльНДС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоляРасшифровки</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СверкаДекларацийПрибыльНДС/Ext/ObjectModule.bsl
#Область СлужебныйПрограммныйИнтерфейс 

Функция ПараметрыКомпоновки() Экспорт
	
	Результат = Новый Структура("ПараметрыОтчета, СКД, Настройки");
	ПараметрыОтчета = ПараметрыОтчета();

	Результат.ПараметрыОтчета = ПараметрыОтчета;	
	Если ЗначениеЗаполнено(ПоляРасшифровки) Тогда
			
		Результат.СКД = ?(ПоляРасшифровки["Номер"] < 3000,
			ПолучитьМакет("РасшифровкаОтчеты"), 
			ПолучитьМакет("РасшифровкаДокументы"));
		Результат.Настройки = Результат.СКД.НастройкиПоУмолчанию;
		
	Иначе
		
		Результат.СКД = ПолучитьМакет("Основная");
		УстановитьПараметрКомпоновки("Период", Новый СтандартныйПериод(
			ПараметрыОтчета.НачалоПериода,ПараметрыОтчета.КонецПериода));
		Результат.Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные) Тогда
		Результат.Вставить("НаборыДанных", 
			Новый Структура("Данные", ПолучитьИзВременногоХранилища(Данные)));
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПараметрыОтчета()
	
	Результат = Отчеты.СверкаДекларацийПрибыльНДС.ПараметрыРасчета();
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);
	Результат.Вставить("ПоляРасшифровки", ПоляРасшифровки);
	Результат.Вставить("Данные", Данные);
	Результат.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	Результат.Вставить("ИдентификаторОтчета", Метаданные.Отчеты.СверкаДекларацийПрибыльНДС.Имя);
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПараметрКомпоновки(Параметр, Значение)
	
	ПараметрыДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Параметр = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных(Параметр));  
	Параметр.Значение = Значение;
	
КонецПроцедуры

#КонецОбласти
